{
  "backend/main.mo": "Motoko actor defining AC submission backend with validation, duplicate detection, and authenticated admin queries for submissions and customer contacts; stores submissions in a Map keyed by brand+model+customerName.",
  "feature_evidence.json": "Feature evidence report documenting four error handling and logging improvements across frontend components (ACSubmissionForm, Admin page, ErrorBoundary, and network handling in hooks).",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components, pages, hooks, and styling with emphasis on error handling, authentication flows, and contact information display.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining warm earth tone design tokens for light and dark modes, including primary, secondary, accent, and sidebar color variables.",
  "frontend/index.html": "HTML entry point for the AC Buy application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (home, submit, success, pricing, contact, admin), QueryClient, InternetIdentityProvider, and Toaster; defines HistoryState interface for navigation state.",
  "frontend/src/components/ACSubmissionForm.tsx": "AC submission form with comprehensive validation, error classification by type (network, timeout, validation, duplicate), detailed console logging throughout submission flow, and conditional error UI with icons and troubleshooting guidance.",
  "frontend/src/components/ContactInfo.tsx": "Reusable card component displaying four contact detail sections (phone, email, address, business hours) with icons and descriptions in a responsive grid layout.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors, displays error details with stack traces in a card UI, and provides a retry button to reset the error state.",
  "frontend/src/components/Layout.tsx": "Main layout component with navigation, mobile menu, and Internet Identity authentication integration that handles login/logout flows and redirects to admin dashboard after successful authentication.",
  "frontend/src/components/PricingCalculator.tsx": "Interactive pricing calculator component that displays estimated AC buyback prices based on age/condition selection (2-3 years, 3-5 years, or dead/non-functional) with formatted INR currency display.",
  "frontend/src/components/PricingFactorCard.tsx": "Reusable card component that displays a pricing factor with an icon, title, and description, supporting both Lucide icons and custom image sources.",
  "frontend/src/hooks/useACSubmission.ts": "Custom hook that manages AC submission form data to the backend canister, handling loading states, error messages, and detailed logging for network/timeout/backend errors.",
  "frontend/src/hooks/useActor.ts": "React Query-based hook that creates and manages the backend actor instance, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching submissions data from the backend actor, including useGetAllSubmissions and useGetSubmission with comprehensive error handling, logging, and retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for both light and dark modes, including primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays all AC submissions in a table format, requires Internet Identity authentication, and includes condition formatting helpers and error handling with retry functionality.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying company contact information, multiple communication channels, and an FAQ section about the AC buying process, pickup services, and accepted brands.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards highlighting competitive pricing and eco-friendly service, and a 'How It Works' section explaining the AC selling process.",
  "frontend/src/pages/PricingInfo.tsx": "Pricing information page explaining factors that affect AC valuation (age, condition, brand, efficiency, market demand) with a pricing calculator component and example pricing tiers.",
  "frontend/src/pages/SubmissionSuccess.tsx": "Success page displayed after AC submission form completion, showing customer contact details and next steps with owner phone numbers for direct contact.",
  "frontend/src/pages/SubmitAC.tsx": "AC submission page that renders the ACSubmissionForm component with introductory text and feature cards highlighting quick response, no obligation, and secure process.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with Inter font, and custom animations for accordion components.",
  "project_state.json": "Project metadata tracking features, known issues (quote form submission error and admin contact details error), and architectural notes about unauthenticated admin dashboard access."
}