{
  "backend/main.mo": "Motoko actor defining AC submission backend with Condition enum, Submission type, and functions to submit, retrieve, and list AC submissions with authentication checks for admin routes.",
  "feature_evidence.json": "Feature evidence report documenting four features related to debugging and fixing the Internet Identity login flow for the Admin Dashboard button in Layout.tsx.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend source files including components, pages, hooks, and configuration files with details about their functionality and implementation.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-tone color palette using OKLCH color system for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with basic meta tags, title 'AC Buy', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, submit, success, pricing, contact, and admin pages, plus HistoryState interface for passing customer contact data.",
  "frontend/src/components/ACSubmissionForm.tsx": "Form component for AC submission with validation, error handling, and navigation to success page with customer contact details passed via state after successful backend submission.",
  "frontend/src/components/ContactInfo.tsx": "Reusable card component displaying business contact information including phone, email, address, and business hours with icons in a grid layout.",
  "frontend/src/components/Layout.tsx": "Main layout component with navigation, mobile menu, and Internet Identity authentication flow. Handles admin dashboard access with login state management and user-friendly error messages.",
  "frontend/src/components/PricingCalculator.tsx": "Interactive pricing calculator component that displays estimated AC buyback prices based on age/condition selection (2-3 years, 3-5 years, or dead/non-functional).",
  "frontend/src/components/PricingFactorCard.tsx": "Reusable card component for displaying pricing factors with an icon, title, and description.",
  "frontend/src/hooks/useACSubmission.ts": "Custom hook for submitting AC buyback requests to the backend canister with error handling and loading states.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with React Query, supporting both authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching AC submissions from the backend, including getAllSubmissions and getSubmission with authentication error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette defined as CSS variables for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that requires Internet Identity authentication to view all AC submissions in a sortable table with condition badges, refresh functionality, and formatted timestamps.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying company contact information, response time expectations, multiple contact channels, and an FAQ section about the AC buying process.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards highlighting competitive pricing and eco-friendly service, and a 'How It Works' section with CTAs to submit AC details or view pricing.",
  "frontend/src/pages/PricingInfo.tsx": "Pricing information page explaining factors that affect AC valuation (age, condition, brand, efficiency, demand, original value) with an interactive pricing calculator and example price ranges.",
  "frontend/src/pages/SubmissionSuccess.tsx": "Success confirmation page shown after AC submission, displaying customer contact details from navigation state, next steps, and owner phone numbers for direct contact.",
  "frontend/src/pages/SubmitAC.tsx": "AC submission form page with informational cards about quick response, no obligation, and secure process, containing the ACSubmissionForm component for collecting AC details.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH color space, typography settings with Inter font, container configurations, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a used air conditioner purchase website, documenting 10 implemented features, known issues including missing owner contact details on quote submission and non-functional admin login, and noting that the admin dashboard currently lacks authentication."
}