{
  "backend/main.mo": "Motoko actor defining AC submission storage with types for Condition and Submission, and three public functions: submitAirConditioner (stores submissions with generated ID), getSubmission (retrieves by ID), and getAllSubmissions (returns all submissions).",
  "feature_evidence.json": "Feature evidence report documenting the footer phone number update feature (889700937, 6304843930, +917095510215) in Layout.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the AC buying application's routing, components, pages, hooks, and styling with warm earth-tone color scheme.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes using neutral grayscale tones (no hue) and custom properties for UI components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the AC Buy application.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, submit, success, pricing, and contact pages, all wrapped in Layout component with router provider.",
  "frontend/src/components/ACSubmissionForm.tsx": "Form component with validation for AC details (brand, model, age, condition) and customer info (name, phone, email), using useACSubmission hook and navigating to success page on completion.",
  "frontend/src/components/ContactInfo.tsx": "Card component displaying contact details (phone, email, address, business hours) in a grid layout with icons.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with sticky header navigation, mobile menu, Wind icon logo, and footer displaying three phone numbers (889700937, 6304843930, +917095510215) with caffeine.ai attribution.",
  "frontend/src/components/PricingFactorCard.tsx": "Reusable card component for displaying pricing factors with icon (LucideIcon or image), title, and description.",
  "frontend/src/hooks/useACSubmission.ts": "Custom hook managing AC submission state, calling backend actor's submitAirConditioner method, and handling loading/error states.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching backend actor with optional Internet Identity authentication, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching submission data from the backend actor, including getAllSubmissions and getSubmission by ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-tone color palette for light and dark modes, defining CSS variables for UI components like primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying communication channels, response time information, FAQ section, and ContactInfo component for reaching the AC buying service.",
  "frontend/src/pages/Home.tsx": "Homepage with hero section, feature cards highlighting competitive pricing and eco-friendly service, and a 'How It Works' section explaining the AC selling process.",
  "frontend/src/pages/PricingInfo.tsx": "Pricing information page explaining factors affecting AC valuation (age, condition, brand, efficiency, demand) with example price ranges and CTA to submit for quote.",
  "frontend/src/pages/SubmissionSuccess.tsx": "Success confirmation page displayed after AC submission, outlining next steps in the review process and providing navigation options to home or submit another unit.",
  "frontend/src/pages/SubmitAC.tsx": "React page component that renders a form for customers to submit their used air conditioner details, featuring benefit cards (quick response, no obligation, secure process) and an ACSubmissionForm component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, typography, container settings, custom animations, and design tokens for a component library.",
  "project_state.json": "Project state tracking file documenting completed features for a used air conditioner purchase website, including homepage, submission form, pricing display, contact section, INR currency updates, and phone number changes."
}