{
  "backend/main.mo": "Motoko actor defining AC submission system with types (Condition, Submission), storage in a Map, submitAC function with validation and duplicate checking, and authenticated query functions (getSubmission, getAllSubmissions, getAllCustomerContacts) protected by assertIsAuthenticated.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related features in Layout.tsx: checking if user is authenticated before calling login(), adding conditional navigation logic, and implementing error handling for already-authenticated scenarios.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend source files including components, pages, hooks, and configuration files with focus on authentication flow, form handling, and UI structure.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark modes, including neutral grayscale palette and theme tokens for UI components.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading main.tsx, titled 'AC Buy'.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with routes (home, submit, success, pricing, contact, admin), QueryClient, InternetIdentityProvider, Toaster, and HistoryState interface for passing customer contact data.",
  "frontend/src/components/ACSubmissionForm.tsx": "Form component for AC submission with validation, state management, error handling, and navigation to success page with customer contact details passed via history state after successful backend submission.",
  "frontend/src/components/ContactInfo.tsx": "Reusable card component displaying contact information (phone, email, address, business hours) with icons in a responsive grid layout.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with header navigation, mobile menu, admin dashboard button with authentication checking using identity.getPrincipal().isAnonymous(), comprehensive error handling for already-authenticated scenarios, logout functionality, and detailed console logging throughout authentication flow.",
  "frontend/src/components/PricingCalculator.tsx": "Interactive pricing calculator component that displays estimated AC buyback prices based on age/condition selection (2-3 years: ₹3000-4000, 3-5 years: ₹2500, dead: ₹2000).",
  "frontend/src/components/PricingFactorCard.tsx": "Reusable card component that displays a pricing factor with an icon, title, and description, supporting both Lucide icons and custom image sources.",
  "frontend/src/hooks/useACSubmission.ts": "Custom hook that handles AC submission form data to the backend canister, managing submission state, error handling, and detailed logging throughout the process.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication state with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching AC submissions from the backend, including getAllSubmissions and getSubmission by ID with error handling and authentication checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-toned color palette defined using CSS variables for both light and dark modes, including primary terracotta/rust colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that requires Internet Identity authentication to view all customer AC submissions in a sortable table with filtering, refresh capability, and displays submission details including condition badges and timestamps.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying multiple contact channels, quick response information, and an FAQ section covering quote process, pickup services, accepted brands, and non-working units.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section featuring call-to-action buttons, four feature cards highlighting competitive prices/speed/trust/eco-friendliness, and a 'How It Works' section explaining the AC selling process.",
  "frontend/src/pages/PricingInfo.tsx": "Pricing information page with an interactive calculator, six pricing factor cards (age, condition, brand, efficiency, demand, value), example pricing tiers, and a CTA to submit AC details for a personalized quote.",
  "frontend/src/pages/SubmissionSuccess.tsx": "Success confirmation page displayed after AC submission, showing customer contact details, next steps timeline, owner phone numbers for direct contact, and navigation buttons to home or submit another AC.",
  "frontend/src/pages/SubmitAC.tsx": "AC submission form page with three benefit cards (quick response, no obligation, secure process) and the main ACSubmissionForm component for users to enter their air conditioner details.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH color space, typography settings with Inter font, container queries, animations, and various UI component styles for a design system.",
  "project_state.json": "Project state tracking file for a used air conditioner purchase website, documenting 33 versions of features including homepage, quote submission form, admin dashboard, and known issues with authentication and contact details display."
}