{
  "backend/main.mo": "Motoko actor defining AC submission storage with Map-based persistence, public functions for submitting/retrieving AC data, and authentication checks requiring non-anonymous principals for admin routes.",
  "feature_evidence.json": "Feature evidence report documenting that the Admin Dashboard link was added to the mobile menu in Layout.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, layout with mobile menu, AC submission flow, pricing pages, admin authentication, and styling with warm OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes, defining neutral grayscale palette with custom radius, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the AC Buy application.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, submit, success, pricing, contact, and admin pages, all wrapped in Layout component.",
  "frontend/src/components/ACSubmissionForm.tsx": "Form component with validation for AC details (brand, model, age, condition) and customer info (name, phone, email), using useACSubmission hook and navigating to success page on submit.",
  "frontend/src/components/ContactInfo.tsx": "Card component displaying contact details (phone, email, address, business hours) with icons in a responsive grid layout.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with sticky header navigation (desktop and mobile menu including Admin Dashboard link), logout button when authenticated, and footer with phone numbers and caffeine.ai attribution.",
  "frontend/src/components/PricingFactorCard.tsx": "Reusable card component displaying pricing factors with icon (Lucide or image), title, and description with hover effects.",
  "frontend/src/hooks/useACSubmission.ts": "Custom hook managing AC submission state, calling backend actor's submitAirConditioner function, and handling loading/error states.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration, managing identity state and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching submissions data from the backend actor, including getAllSubmissions and getSubmission by ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earth-toned color scheme for light and dark modes, defining CSS variables for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page requiring Internet Identity authentication to view and manage all customer AC purchase submissions in a sortable table.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying company contact information, multiple communication channels, and FAQ section about the AC buying process.",
  "frontend/src/pages/Home.tsx": "Landing page with hero section, feature cards highlighting service benefits, and how-it-works section for selling used air conditioners.",
  "frontend/src/pages/PricingInfo.tsx": "Displays pricing information page explaining factors that affect used AC purchase prices (age, condition, brand, efficiency, demand, original value) with examples and a CTA to submit AC details.",
  "frontend/src/pages/SubmissionSuccess.tsx": "Success confirmation page shown after AC submission, displaying next steps and providing navigation options to return home or submit another AC.",
  "frontend/src/pages/SubmitAC.tsx": "AC submission page containing the form where customers enter details about their used air conditioner, with benefit cards highlighting quick response, no obligation, and secure process.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, container settings, font families, border radius variables, custom shadows, and accordion animations.",
  "project_state.json": "Project state tracking document listing implemented features, known issues (admin dashboard lacks authentication and navigation link), and architectural notes for a used AC purchase website."
}